from pandas_ods_reader import read_ods
from pprint import pprint
import json

#pprint(NDate5)
base_path = "/home/sohiab/IntelligentLab1/AILab1DataSet.ods"
sheet_index = 1
data = read_ods(base_path, 1, columns=["No.","Имя", "Цена($)/Кг","Страна","Регион","Размер","Цвет","Сладость","жесткость/влажность"])
print(data[])
Date=data['Имя'].to_list()
NDate1 = Date[0:15]
NDate2 = Date[16:31]    
NDate3 = Date[32:48]   
print("\n")
print("////////////////////////////////////// THE LIST of DATES - СПИСОК ФИНИКИ /////////////////////////////////////////////////////////////////////////////////////////////")
print("----------------------------------------------------------------------------------------------------------------------------------------------------------------------")
print(NDate1)
print("//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////")
print(NDate2)
print("//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////")
print(NDate3)
print("----------------------------------------------------------------------------------------------------------------------------------------------------------------------")
print("//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////")
print("\n")


#newdf = data.loc[(data.Страна == "JFK") | (data.origin == "LGA")]
newdf = data.loc[(data.Страна == "Саудовская Аравия")]
print(newdf)
#print(json.dumps(NDate1, indent=4), end = ' ')




Question1 = input('Какие финики самое мягкий или полусухой или сухой? \n')

if "или" in Question1:
    print("good")